In [154]:
# Import Dependencies
import pandas as pd
import numpy as np

In [155]:
# Create a path to the csv and read it into a Pandas DataFrame

df = pd.read_csv("client_dataset.csv")

df.head()

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,item_id,category,subcategory,unit_price,unit_cost,unit_weight,qty,line_number
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,EUD29711-63-6U,decor,wall art,1096.80,762.71,7.50,105,1
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,XDA18116-89-4A,consumables,pens,24.95,15.09,1.49,21,0
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,ABE59463-05-7E,software,project management,13.52,7.86,1.68,39,6
3,Nathan,Baker,Accounting technician,827-788-8123x012,bakernathan@benson.com,46554,9031802,2023-04-25,17,2023,ZMM00836-65-0C,consumables,pens,36.42,24.85,1.23,29,3
4,Christina,Schwartz,Chiropractor,265-829-3643,christinaschwartz9252@mcconnell.com,92089,1322274,2023-05-28,21,2023,BZX55559-12-3X,consumables,misc,195.10,108.17,46.43,20,1

In [167]:
# View the column names in the data
df.columns

Index(['first', 'last', 'job', 'phone', 'email', 'client_id', 'order_id',
       'order_date', 'order_week', 'order_year', 'item_id', 'category',
       'subcategory', 'unit_price', 'unit_cost', 'unit_weight', 'qty',
       'line_number', 'subtotal', 'total_weight', 'shipping_price'],
      dtype='object')

In [157]:
# Use the describe function to gather some basic statistics
df.describe()

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

In [158]:
# Use this space to do any additional research
# and familiarize yourself with the data.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54639 entries, 0 to 54638
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first        54639 non-null  object
 1   last         54639 non-null  object
 2   job          54639 non-null  object
 3   phone        54639 non-null  object
 4   email        54639 non-null  object
 5   client_id    54639 non-null  int64
 6   order_id     54639 non-null  int64
 7   order_date   54639 non-null  object
 8   order_week   54639 non-null  int64
 9   order_year   54639 non-null  int64
 10  item_id      54639 non-null  object
 11  category     54639 non-null  object
 12  subcategory  54639 non-null  object
 13  unit_price   54639 non-null  float64
 14  unit_cost    54639 non-null  float64
 15  unit_weight  54639 non-null  float64
 16  qty          54639 non-null  int64
 17  line_number  54639 non-null  int64
dtypes: float64(3), int64(6), object(9)
memory usage: 7.5+ MB

In [159]:
# What three item categories had the most entries?
top_categories = df['category'].value_counts().head(3)
top_categories

category
consumables    23538
furniture      11915
software        8400
Name: count, dtype: int64

In [160]:
# For the category with the most entries, which subcategory had the most entries?
 
top_subcategory_in_top_category = client_df ['subcategory'].value_counts()
top_subcategory_in_top_category.head()

subcategory
bathroom supplies    6424
paper products       5874
kitchen supplies     5746
tables               4540
misc                 4286
Name: count, dtype: int64

In [161]:
# Which five clients had the most entries in the data?
top_clients = client_df ['client_id'].value_counts().head(5)
top_clients

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
Name: count, dtype: int64

In [162]:
# Store the client IDs of those top 5 clients in a list

df[['client_id', 'first','last']].value_counts().head()

client_id  first      last
33615      Jessica    Reyes      220
66037      Angela     Everett    211
46820      Bryan      Myers      209
38378      Alexandra  Young      207
24741      Kendra     Garrett    207
Name: count, dtype: int64

In [163]:
# How many total units (the qty column) did the client with the most entries order?
top_client_id = client_df['client_id'].value_counts()
most_entries_client_id = top_client_id.idxmax()
most_entries_client_df = df[df['client_id'] == most_entries_client_id]
total_units = most_entries_client_df['qty'].sum()
print (total_units)

64313

In [164]:
# Create a column that calculates the subtotal for each line using the unit_price and the qty
df['subtotal'] = df['qty'] * df['unit_price']
totals = df[['subtotal','qty', 'unit_price']].head()
totals

    subtotal  qty  unit_price
0  115164.00  105     1096.80
1     523.95   21       24.95
2     527.28   39       13.52
3    1056.18   29       36.42
4    3902.00   20      195.10

In [165]:
# Create a column for shipping price.
# Assume a shipping price of $7 per pound for orders over 50 pounds and $10 per pound for items 50 pounds or under.
total_weight = df ['unit_weight'] * df ['qty']
df ['total_weight'] = total_weight

shipping = df.apply(lambda x: x['total_weight']*7 \
                           if x['total_weight'] > 50 else x ['total_weight']* 10, axis=1)

shipping_price =  df['shipping_price'] = shipping


df [['unit_price', 'unit_weight', 'qty', 'total_weight', 'shipping_price',]].head()

   unit_price  unit_weight  qty  total_weight  shipping_price
0     1096.80         7.50  105        787.50         5512.50
1       24.95         1.49   21         31.29          312.90
2       13.52         1.68   39         65.52          458.64
3       36.42         1.23   29         35.67          356.70
4      195.10        46.43   20        928.60         6500.20

In [168]:
# Create a column for the total price using the subtotal and the shipping price along with a sales tax of 9.25%
df['total_price'] = round(((df['subtotal'] + df['shipping_price']) *1.0925),2)
df['tax_payable'] = round(((df['subtotal'] + df['shipping_price']) *0.0925),2)
df[['subtotal', 'shipping_price','tax_payable','total_price']].head()

    subtotal  shipping_price  tax_payable  total_price
0  115164.00         5512.50     11162.58    131839.08
1     523.95          312.90        77.41       914.26
2     527.28          458.64        91.20      1077.12
3    1056.18          356.70       130.69      1543.57
4    3902.00         6500.20       962.20     11364.40

In [170]:

#reate a column for the total price using the subtotal and the shipping price along with a sales tax of 9.25%
df['line_cost'] = (df['unit_cost'] * df['qty']) + df['shipping_price']
df[['unit_cost', 'qty', 'shipping_price','line_cost']].head()

   unit_cost  qty  shipping_price  line_cost
0     762.71  105         5512.50   85597.05
1      15.09   21          312.90     629.79
2       7.86   39          458.64     765.18
3      24.85   29          356.70    1077.35
4     108.17   20         6500.20    8663.60

In [171]:
# Create a column for the cost of each line using unit cost, qty, and shipping price (assume the shipping cost is exactly what is charged to the client).
df['line_profit'] = df['total_price'] - df['line_cost']
round(df[['total_price', 'line_cost','line_profit']].head(),2)

   total_price  line_cost  line_profit
0    131839.08   85597.05     46242.03
1       914.26     629.79       284.47
2      1077.12     765.18       311.94
3      1543.57    1077.35       466.22
4     11364.40    8663.60      2700.80

In [ ]:
# Create a column for the profit of each line using line cost and line price.
df ['line_cost'] = df ['unit_cost'] *  df ['qty'] + df ['shipping_price']
df

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,...,unit_weight,qty,line_number,line_subtotal,total_weight,shipping_price,total_price,line_cost,line_profit,subtotal
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,...,7.50,105,1,115164.00,787.50,5512.50,131839.076250,85597.05,84834.34,115164.00
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,...,1.49,21,0,523.95,31.29,312.90,914.258625,629.79,614.70,523.95
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,...,1.68,39,6,527.28,65.52,458.64,1077.117600,765.18,757.32,527.28
3,Nathan,Baker,Accounting technician,827-788-8123x012,bakernathan@benson.com,46554,9031802,2023-04-25,17,2023,...,1.23,29,3,1056.18,35.67,356.70,1543.571400,1077.35,1052.50,1056.18
4,Christina,Schwartz,Chiropractor,265-829-3643,christinaschwartz9252@mcconnell.com,92089,1322274,2023-05-28,21,2023,...,46.43,20,1,3902.00,928.60,6500.20,11364.403500,8663.60,8555.43,3902.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
54634,Lauren,Reese,Radio producer,977.877.5272x11382,late_reese_4081@montoya-chavez.org,29043,9021716,2023-04-26,17,2023,...,2.25,33,8,2743.29,74.25,519.75,3564.871200,2222.55,2170.95,2743.29
54635,Derrick,Moore,Musician,358.661.5483,derrick.moore.2602@pope.info,41908,6290153,2023-02-08,6,2023,...,11.70,47,0,9709.73,549.90,3849.30,14813.240275,12095.92,11920.46,9709.73
54636,Monica,Gutierrez,Graphic designer,294.805.9100x339,gutierrezm3195@morris.org,35176,8692622,2023-03-05,9,2023,...,4.16,475,6,31188.50,1976.00,13832.00,49184.896250,41054.25,40996.94,31188.50
54637,Wanda,Solomon,Toxicologist,(311)767-4924,solomonwanda5962@ross.org,24485,7592730,2023-01-18,3,2023,...,18.04,112,0,165.76,2020.48,14143.36,15632.713600,14280.00,14278.78,165.76
54638,Dwayne,Bell,Chief Financial Officer,606-619-7667x9508,belld@galvan.com,24007,7489403,2023-01-04,1,2023,...,2.07,1031,5,3103.31,2134.17,14939.19,19711.431250,16599.10,16597.49,3103.31

In [173]:
# How much did each of the top 5 clients by quantity spend? Use your work from Part 1 for client ids?
# Check your work using the totals above


order_ids	 = [2742071, 2173913, 6128929]

def find_orders(order_id):
    order_lines_df = df.loc[df['order_id'] == order_id, 'total_price']
    return round(order_lines_df.sum(),2)

for order_id in order_ids:
    print(f"Order {order_id} total: ${find_orders(order_id)}")

Order 2742071 total: $152811.89
Order 2173913 total: $162388.71
Order 6128929 total: $923441.25

In [ ]:
# How much did each of the top 5 clients by quantity spend? Check your work from Part 1 for client ids.

df[['client_id', 'first','last']].value_counts().head()

client_id  first      last
33615      Jessica    Reyes      220
66037      Angela     Everett    211
46820      Bryan      Myers      209
38378      Alexandra  Young      207
24741      Kendra     Garrett    207
Name: count, dtype: int64

In [ ]:
# Create a summary DataFrame showing the totals for the for the top 5 clients with the following information:
# total units purchased, total shipping price, total revenue, and total profit. 
data_dictionary = {'client_id': top_five_client_ids }
columns = ['qty','shipping_price','total_price','line_cost','line_profit'] 
for col in columns:
    data_dictionary[col] = [clients_total(client_id, col) 
                           for client_id in top_five_client_ids]
    
new_data_frame = pd.DataFrame(data_dictionary)
new_data_frame

,client_id,qty,shipping_price,total_price,line_cost,line_profit
0,33615,8377308.57,8377308.57,8377308.57,8377308.57,8377308.57
1,66037,10259514.80,10259514.80,10259514.80,10259514.80,10259514.80
2,46820,9743794.32,9743794.32,9743794.32,9743794.32,9743794.32
3,38378,12906550.88,12906550.88,12906550.88,12906550.88,12906550.88
4,24741,82268891.98,82268891.98,82268891.98,82268891.98,82268891.98

In [ ]:
#create total price

def clients_total(client_id, column):
    client_df = df.loc[df['client_id'] == client_id, column]  
    return round(client_df.sum(),2)

for client_id in top_five_client_ids:
    print(f"{client_id} total: ${clients_total(client_id, 'total_price')}")

33615 total: $8377308.57
66037 total: $10259514.8
46820 total: $9743794.32
38378 total: $12906550.88
24741 total: $82268891.98

In [176]:
#rename the Dataframe
data_dictionary = {'client_id': top_five_client_ids }
columns = ['qty','shipping_price','total_price','line_cost','line_profit'] 
for col in columns:
    data_dictionary[col] = [clients_total(client_id, col) 
                           for client_id in top_five_client_ids]
    
new_data_frame = pd.DataFrame(data_dictionary)
new_data_frame

   client_id     qty  shipping_price  total_price    line_cost  line_profit
0      33615   64313      1828984.89   8377308.52   6175313.91   2201994.61
1      66037   43018      1395151.85  10259514.79   7004482.98   3255031.81
2      46820   75768      1601448.84   9743794.36   7007191.64   2736602.72
3      38378   73667      3429455.40  12906550.87   9634720.98   3271829.89
4      24741  239862      5126448.37  82268892.02  45688899.71  36579992.31

In [177]:
# Format the data and rename the columns to names suitable for presentation.
# Format the data and rename the columns to names suitable for presentation.
# Define the money columns. 
# Define a function that converts a dollar amount to millions.
# Apply the currency_format_millions function to only the money columns. 
# Rename the columns to reflect the change in the money format. 

columns = ['line_profit','total_price', 'shipping_price','line_cost'] 

def currency_million(amount):
    return amount/1000000

for col in columns:
    new_data_frame[col] = new_data_frame[col].apply(currency_million)
new_data_frame

   client_id     qty  shipping_price  total_price  line_cost  line_profit
0      33615   64313        1.828985     8.377309   6.175314     2.201995
1      66037   43018        1.395152    10.259515   7.004483     3.255032
2      46820   75768        1.601449     9.743794   7.007192     2.736603
3      38378   73667        3.429455    12.906551   9.634721     3.271830
4      24741  239862        5.126448    82.268892  45.688900    36.579992

In [179]:
# Rename the columns to reflect the change in the money format. 
new_data_frame = new_data_frame.rename(columns={'client_id': "Client Id",
                               'qty': "Quantity Purchased",
                               'shipping_price': "Shipping Costs (Millions)" ,
                               'total_price': "Gross Revenue (Millions)",
                               'line_cost': "Total Costs (Millions)",
                               'line_profit':"Total Profit (Millions)" }
                      )
new_data_frame

,Client Id,Quantity Purchased,Shipping Costs (Millions),Gross Revenue (Millions),Total Costs (Millions),Total Profit (Millions)
0,33615,64313,1.828985,8.377309,6.175314,2.201995
1,66037,43018,1.395152,10.259515,7.004483,3.255032
2,46820,75768,1.601449,9.743794,7.007192,2.736603
3,38378,73667,3.429455,12.906551,9.634721,3.271830
4,24741,239862,5.126448,82.268892,45.688900,36.579992

In [182]:
# Sort the updated data by "Total Profit (millions)" form highest to lowest and assign the sort to a new DatFrame.

sort_new_data = new_data_frame.sort_values(("Total Profit (Millions)"), ascending=False)
sort_new_data

,Client Id,Quantity Purchased,Shipping Costs (Millions),Gross Revenue (Millions),Total Costs (Millions),Total Profit (Millions)
4,24741,239862,5.126448,82.268892,45.688900,36.579992
3,38378,73667,3.429455,12.906551,9.634721,3.271830
1,66037,43018,1.395152,10.259515,7.004483,3.255032
2,46820,75768,1.601449,9.743794,7.007192,2.736603
0,33615,64313,1.828985,8.377309,6.175314,2.201995

In [ ]:
#Summary and Analyza

# Client 24741 had the most units purchased and total profits
# Client 33615 had the least units purchased and total profits